app/Controllers/User.php

    public function processLogin()
    {
        helper('cookie');
        $userModel = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'test@gmail.com'
 LIMIT 1

    public function sendResetLink()
    {
        $userModel = new UserModel();
        $email = $this->request->getPost('email');

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'bhargav.r@biztechnosys.com'
 LIMIT 1