app/Models/UserModel.php

    public function generateResetToken($email)
    {
        $user = $this->where('email', $email)->first();

        if (!$user) {
            return false;
        }

        $resetToken = bin2hex(random_bytes(32));
        $resetTokenExpiredAt = date('Y-m-d H:i:s', strtotime('+1 day')); // Token valid for 1 day

        $this->update($user['id'], ['reset_token' => $resetToken, 'reset_token_expired_at' => $resetTokenExpiredAt]);
---
SELECT *
FROM `users`
WHERE `email` = 'bhargav.r@biztechnosys.com'
 LIMIT 1
UPDATE `users` SET `reset_token` = '43beea2826d20ec8468881915583eafc9bd40d5b438d5b7bc68eec62f32748f9', `reset_token_expired_at` = '2024-06-19 10:33:52'
WHERE `users`.`id` IN ('4')

    public function validateResetToken($resetToken)
    {
        $user = $this->where('reset_token', $resetToken)->first();
---
SELECT *
FROM `users`
WHERE `reset_token` = '43beea2826d20ec8468881915583eafc9bd40d5b438d5b7bc68eec62f32748f9'
 LIMIT 1